haskell/polymorphism_and_typeclasses.org
#+TITLE:  Polymorphism and Typeclasses
#+KEYWORDS: polymorphism ad-hoc typeclass haskell fp

* Polymorphism and Typeclasses
** Polymorphism 
*** Parametric Polymorphism 

_Parametric polymorphism_ - Type of a value has one or more
unconstrained type variables. The type variable can take any value.

 - Single algorithm can have many types.

 - Example: Haskell function id, head and tail

Examples: 

#+BEGIN_SRC haskell
  -- Identity function.
  id :: a -> a 
  id x = x 

  > id "hello"
  "hello"
  it :: [Char]
  > id (Just 10)
  Just 10
  it :: Num a => Maybe a
  > 

  -- List functions.
  --
  --
  -- The type 'a' can be replaced by Int, String, Maybe Int, (Int -> Int)
  --  or anything.
  --------------------

  head (x:xs) = x
  head []     = error "*** Exception: Prelude.head: empty list"              

  > :t head
  head :: [a] -> a
  > 
  > :t tail
  tail :: [a] -> [a]
  > 

  > :t head ["hello", "world", "haskell"]
  head ["hello", "world", "haskell"] :: [Char]
  > head ["hello", "world", "haskell"]
  "hello"
  it 

  > :t head [\x -> x + 1, \a -> a * 3, \b -> b -5]
  head [\x -> x + 1, \a -> a * 3, \b -> b -5] :: Num a => a -> a
  > head [\x -> x + 1, \a -> a * 3, \b -> b -5] $ 9
  10
  it :: Num a => a
  > 

#+END_SRC

