haskell/polymorphism_and_typeclasses.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Polymorphism and Typeclasses</title>
<!-- 2018-05-07 Mon 11:30 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="nobody" />
<meta  name="keywords" content="polymorphism ad-hoc typeclass haskell fp" />
<meta name="viewport" content="width=device-width, minimum-scale=1.0, maximum-scale=1.0" />
<link href="/Functional-Programming/theme/style.css" rel="stylesheet">
</head>
<body>
<div id="content">
<h1 class="title">Polymorphism and Typeclasses</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Polymorphism and Typeclasses</a>
<ul>
<li><a href="#sec-1-1">1.1. Polymorphism</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. Parametric Polymorphism</a></li>
<li><a href="#sec-1-1-2">1.1.2. Ad-hoc Polymorphism</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. Typeclasses</a></li>
<li><a href="#sec-1-3">1.3. Examples</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. Refactoring functions to work with many types</a></li>
<li><a href="#sec-1-3-2">1.3.2. Defining typeclasses instances</a>
<ul>
<li><a href="#sec-1-3-2-1">1.3.2.1. Defining a new instance of typeclass Functor</a></li>
<li><a href="#sec-1-3-2-2">1.3.2.2. Defining a new instance of typeclass Num.</a></li>
<li><a href="#sec-1-3-2-3">1.3.2.3. Complex Number Implementation</a></li>
<li><a href="#sec-1-3-2-4">1.3.2.4. Vector Arithmetic</a></li>
<li><a href="#sec-1-3-2-5">1.3.2.5. Num a =&gt; Maybe a as instance of Num typeclass</a></li>
</ul>
</li>
<li><a href="#sec-1-3-3">1.3.3. Creating a type class</a></li>
<li><a href="#sec-1-3-4">1.3.4. References</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<lu> 
  <li><a href="/Functional-Programming/index.html">Index</a></li>
  <li><a href="https://github.com/caiorss/Functional-Programming">Repository</a></li>
</lu>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Polymorphism and Typeclasses</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Polymorphism</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Parametric Polymorphism</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
<span class="underline">Parametric polymorphism</span> - Type of a value has one or more
unconstrained type variables. The type variable can take any value.
</p>

<ul class="org-ul">
<li>Single algorithm can have many types.
</li>

<li>Example: Haskell function id, head and tail
</li>
</ul>

<p>
Examples: 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-comment-delimiter">-- </span><span class="org-comment">Identity function.</span>
<span class="org-function-name">id</span> <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a 
<span class="org-haskell-definition">id</span> x <span class="org-haskell-operator">=</span> x 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">id</span> <span class="org-string">"hello"</span>
<span class="org-string">"hello"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> [<span class="org-haskell-type">Char</span>]
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">id</span> (<span class="org-haskell-type">Just</span> 10)
<span class="org-haskell-constructor">Just</span> 10
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Maybe</span> a
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">-- </span><span class="org-comment">List functions.</span>
<span class="org-comment-delimiter">--</span>
<span class="org-comment-delimiter">--</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">The type 'a' can be replaced by Int, String, Maybe Int, (Int -&gt; Int)</span>
<span class="org-comment-delimiter">--  </span><span class="org-comment">or anything.</span>
<span class="org-comment-delimiter">--</span><span class="org-comment">------------------</span>

<span class="org-haskell-definition">head</span> (x<span class="org-haskell-type">:</span>xs) <span class="org-haskell-operator">=</span> x
<span class="org-haskell-definition">head</span> <span class="org-haskell-constructor">[]</span>     <span class="org-haskell-operator">=</span> error <span class="org-string">"*** Exception: Prelude.head: empty list"</span>              

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t head
<span class="org-function-name">head</span> <span class="org-haskell-operator">::</span> [a] <span class="org-haskell-operator">-&gt;</span> a
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t tail
<span class="org-function-name">tail</span> <span class="org-haskell-operator">::</span> [a] <span class="org-haskell-operator">-&gt;</span> [a]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t head [<span class="org-string">"hello"</span>, <span class="org-string">"world"</span>, <span class="org-string">"haskell"</span>]
<span class="org-haskell-definition">head</span> [<span class="org-string">"hello"</span>, <span class="org-string">"world"</span>, <span class="org-string">"haskell"</span>] <span class="org-haskell-operator">::</span> [<span class="org-haskell-type">Char</span>]
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">head</span> [<span class="org-string">"hello"</span>, <span class="org-string">"world"</span>, <span class="org-string">"haskell"</span>]
<span class="org-string">"hello"</span>
it 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t head [<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> x <span class="org-haskell-operator">+</span> 1, <span class="org-haskell-operator">\</span>a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">*</span> 3, <span class="org-haskell-operator">\</span>b <span class="org-haskell-operator">-&gt;</span> b <span class="org-haskell-operator">-</span>5]
<span class="org-haskell-definition">head</span> [<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> x <span class="org-haskell-operator">+</span> 1, <span class="org-haskell-operator">\</span>a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">*</span> 3, <span class="org-haskell-operator">\</span>b <span class="org-haskell-operator">-&gt;</span> b <span class="org-haskell-operator">-</span>5] <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">head</span> [<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> x <span class="org-haskell-operator">+</span> 1, <span class="org-haskell-operator">\</span>a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">*</span> 3, <span class="org-haskell-operator">\</span>b <span class="org-haskell-operator">-&gt;</span> b <span class="org-haskell-operator">-</span>5] <span class="org-haskell-operator">$</span> 9
10
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> a
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
