haskell/polymorphism_and_typeclasses.org
*** Ad-hoc Polymorphism 

It allows functions to have different algorithms for each type. The
choice of the algorithme is determined by the context.

In Haskell ad-hoc polymorphism is achieved through typeclasses which
are similar to Java interface. A typeclass defines a set of functions
that must be implemented by every instance of a type class.

The functions defined by a typeclass can have different behaviors
depending on the instance of type class and can be used with all type
class instances. It allows the functions and operators (binary
functions) such as (+) plus, (-) minus, (>>=) monad bind operator to
be reused with many different types and have different algorithms for
each type.

Benefits: 

 - Reuse operators and functiosn with different types.

 - Operator overloading.

 - Functions with a different algorithm for each type. 

 - Code Reuse for free.

Example: The type class _Functor_ 

The function fmap defined by the type class Functor has different
behaviors (algorithms) for each instance such as list, Maybe and
Either types. 


#+BEGIN_SRC haskell 
  -- Functor Type Class 
  -- 
  > :info Functor
  class Functor (f :: * -> *) where
    fmap :: (a -> b) -> f a -> f b
    (<$) :: a -> f b -> f a
    {-# MINIMAL fmap #-}


  -- Instances of Functor type class 
  --
  > :info Functor
  class Functor (f :: * -> *) where
    fmap :: (a -> b) -> f a -> f b
    (<$) :: a -> f b -> f a
    {-# MINIMAL fmap #-}
      -- Defined in ‘GHC.Base’
  instance Functor (Either a) -- Defined in ‘Data.Either’
  instance Functor [] -- Defined in ‘GHC.Base’
  instance Functor Maybe -- Defined in ‘GHC.Base’
  instance Functor IO -- Defined in ‘GHC.Base’
  instance Functor ((->) r) -- Defined in ‘GHC.Base’
  instance Functor ((,) a) -- Defined in ‘GHC.Base’
  > 

  -- Function fmap applies a function (a -> b) to a Functor. 
  --
  > :t fmap
  fmap :: Functor f => (a -> b) -> f a -> f b
  > 

  --- fmap for Functor instance List 
  -------------------------------------------
  data Maybe a = Nothing | Just a 

  instance Functor [a] where
      fmap = map 

  > fmap (\x -> x + 1) [1, 2, 3, 4, 5]
  [2,3,4,5,6]
  it :: Num b => [b]
  > 

  --- fmap for Functor instance Maybe
  -------------------------------------------

  instance Functor (Maybe a) where
      fmap fn (Just a) = Just (fn a)
      fmap fn Nothing  = Nothing 

  > :t fmap (\x -> x + 1) (Just 10)
  fmap (\x -> x + 1) (Just 10) :: Num b => Maybe b
  > 

  > fmap (\x -> x + 1) (Just 10)
  Just 11
  it :: Num b => Maybe b
  > 
  > fmap (\x -> x + 1) Nothing
  Nothing
  it :: Num b => Maybe b
  > 


  --- fmap for Functor instance Either 
  -------------------------------------------

  data Either a b = Left a | Right b

  instance Functor (Either a b) where
      fmap fn (Right b) = Right (fn b)
      fmap fn (Left a)  = Left a 

  > fmap (\x -> x + 1) (Right 10)
  Right 11
  it :: Num b => Either a b                        

  > fmap (\x -> x + 1) (Left "Error: I can't parse the number")
  Left "Error: I can't parse the number"
  it :: Num b => Either [Char] b
  > 



#+END_SRC

