haskell/polymorphism_and_typeclasses.html

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> Ad-hoc Polymorphism</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
It allows functions to have different algorithms for each type. The
choice of the algorithme is determined by the context.
</p>

<p>
In Haskell ad-hoc polymorphism is achieved through typeclasses which
are similar to Java interface. A typeclass defines a set of functions
that must be implemented by every instance of a type class.
</p>

<p>
The functions defined by a typeclass can have different behaviors
depending on the instance of type class and can be used with all type
class instances. It allows the functions and operators (binary
functions) such as (+) plus, (-) minus, (&gt;&gt;=) monad bind operator to
be reused with many different types and have different algorithms for
each type.
</p>

<p>
Benefits: 
</p>

<ul class="org-ul">
<li>Reuse operators and functiosn with different types.
</li>

<li>Operator overloading.
</li>

<li>Functions with a different algorithm for each type. 
</li>

<li>Code Reuse for free.
</li>
</ul>

<p>
Example: The type class <span class="underline">Functor</span> 
</p>

<p>
The function fmap defined by the type class Functor has different
behaviors (algorithms) for each instance such as list, Maybe and
Either types. 
</p>


<div class="org-src-container">

<pre class="src src-haskell"><span class="org-comment-delimiter">-- </span><span class="org-comment">Functor Type Class </span>
<span class="org-comment-delimiter">-- </span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>info <span class="org-haskell-constructor">Functor</span>
<span class="org-haskell-keyword">class</span> <span class="org-haskell-type">Functor</span> (f <span class="org-haskell-operator">::</span> <span class="org-haskell-operator">*</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-operator">*</span>) <span class="org-haskell-keyword">where</span>
  fmap <span class="org-haskell-operator">::</span> (a <span class="org-haskell-operator">-&gt;</span> b) <span class="org-haskell-operator">-&gt;</span> f a <span class="org-haskell-operator">-&gt;</span> f b
  (<span class="org-haskell-operator">&lt;$</span>) <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> f b <span class="org-haskell-operator">-&gt;</span> f a
  <span class="org-haskell-pragma">{-# MINIMAL fmap #-}</span>


<span class="org-comment-delimiter">-- </span><span class="org-comment">Instances of Functor type class </span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>info <span class="org-haskell-type">Functor</span>
<span class="org-haskell-keyword">class</span> <span class="org-haskell-type">Functor</span> (f <span class="org-haskell-operator">::</span> <span class="org-haskell-operator">*</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-operator">*</span>) <span class="org-haskell-keyword">where</span>
  fmap <span class="org-haskell-operator">::</span> (a <span class="org-haskell-operator">-&gt;</span> b) <span class="org-haskell-operator">-&gt;</span> f a <span class="org-haskell-operator">-&gt;</span> f b
  (<span class="org-haskell-operator">&lt;$</span>) <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> f b <span class="org-haskell-operator">-&gt;</span> f a
  <span class="org-haskell-pragma">{-# MINIMAL fmap #-}</span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;GHC.Base&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Functor</span> (<span class="org-haskell-type">Either</span> a) <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;Data.Either&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Functor</span> <span class="org-haskell-constructor">[]</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;GHC.Base&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Functor</span> <span class="org-haskell-type">Maybe</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;GHC.Base&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Functor</span> <span class="org-haskell-type">IO</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;GHC.Base&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Functor</span> (<span class="org-haskell-constructor">(-&gt;)</span> r) <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;GHC.Base&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Functor</span> (<span class="org-haskell-constructor">(,)</span> a) <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;GHC.Base&#8217;</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">-- </span><span class="org-comment">Function fmap applies a function (a -&gt; b) to a Functor. </span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t fmap
<span class="org-function-name">fmap</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Functor</span> f <span class="org-haskell-operator">=&gt;</span> (a <span class="org-haskell-operator">-&gt;</span> b) <span class="org-haskell-operator">-&gt;</span> f a <span class="org-haskell-operator">-&gt;</span> f b
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">--</span><span class="org-comment">- fmap for Functor instance List </span>
<span class="org-comment-delimiter">--</span><span class="org-comment">-----------------------------------------</span>
<span class="org-haskell-keyword">data</span> <span class="org-haskell-type">Maybe</span> a <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span> <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">Just</span> a 

<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Functor</span> [a] <span class="org-haskell-keyword">where</span>
    fmap <span class="org-haskell-operator">=</span> map 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">fmap</span> (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> x <span class="org-haskell-operator">+</span> 1) [1, 2, 3, 4, 5]
[2,3,4,5,6]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> b <span class="org-haskell-operator">=&gt;</span> [b]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">--</span><span class="org-comment">- fmap for Functor instance Maybe</span>
<span class="org-comment-delimiter">--</span><span class="org-comment">-----------------------------------------</span>

<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Functor</span> (<span class="org-haskell-type">Maybe</span> a) <span class="org-haskell-keyword">where</span>
    fmap fn (<span class="org-haskell-constructor">Just</span> a) <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Just</span> (fn a)
    fmap fn <span class="org-haskell-constructor">Nothing</span>  <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t fmap (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> x <span class="org-haskell-operator">+</span> 1) (<span class="org-haskell-constructor">Just</span> 10)
<span class="org-haskell-definition">fmap</span> (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> x <span class="org-haskell-operator">+</span> 1) (<span class="org-haskell-constructor">Just</span> 10) <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> b <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Maybe</span> b
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">fmap</span> (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> x <span class="org-haskell-operator">+</span> 1) (<span class="org-haskell-type">Just</span> 10)
<span class="org-haskell-constructor">Just</span> 11
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> b <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Maybe</span> b
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">fmap</span> (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> x <span class="org-haskell-operator">+</span> 1) <span class="org-haskell-type">Nothing</span>
<span class="org-haskell-constructor">Nothing</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> b <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Maybe</span> b
<span class="org-haskell-operator">&gt;</span> 


<span class="org-comment-delimiter">--</span><span class="org-comment">- fmap for Functor instance Either </span>
<span class="org-comment-delimiter">--</span><span class="org-comment">-----------------------------------------</span>

<span class="org-haskell-keyword">data</span> <span class="org-haskell-type">Either</span> a b <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Left</span> a <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">Right</span> b

<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Functor</span> (<span class="org-haskell-type">Either</span> a b) <span class="org-haskell-keyword">where</span>
    fmap fn (<span class="org-haskell-constructor">Right</span> b) <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Right</span> (fn b)
    fmap fn (<span class="org-haskell-constructor">Left</span> a)  <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Left</span> a 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">fmap</span> (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> x <span class="org-haskell-operator">+</span> 1) (<span class="org-haskell-constructor">Right</span> 10)
<span class="org-haskell-constructor">Right</span> 11
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> b <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Either</span> a b                        

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">fmap</span> (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> x <span class="org-haskell-operator">+</span> 1) (<span class="org-haskell-type">Left</span> <span class="org-string">"Error: I can't parse the number"</span>)
<span class="org-haskell-constructor">Left</span> <span class="org-string">"Error: I can't parse the number"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> b <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Either</span> [<span class="org-haskell-type">Char</span>] b
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
</div>
