haskell/polymorphism_and_typeclasses.org
** Typeclasses 

*Standard Typeclasses*

 - _Num_ - Numeric types. Defines numertic operators (+), (-), (*) and
   functiosn abs and signum.

   - Methods:   (+), (-), (*), abs, signum 
   - Standard Instances:
     - Int       - 29 bits Signed Integer
     - Integer   - Arbitrary precision integer
     - Float     - IEEE 32-bits Float point
     - Double    - IEEE 64-bit Float Point

 - _Ord_ - Comparison.
   - Operators: (<) (<=) (>) (>=) min and max 

 - _Enum_ - Enumeration. Allows syntax such as [1 ... 10], [0.5 .. 0.1 .. 10] ['a' .. 'z']

 - _Eq_ - Equality.
   - Operator (==) and (/=)

 - _Show_ - Defines method show, which converts an instance of this
   type class to string.

 - _Read_ - Defines the function read, which parses a string into a value.


*Type Classes*

Num 

#+BEGIN_SRC haskell 
> :info Num
class Num a where
  (+) :: a -> a -> a
  (-) :: a -> a -> a
  (*) :: a -> a -> a
  negate :: a -> a
  abs :: a -> a
  signum :: a -> a
  fromInteger :: Integer -> a
  {-# MINIMAL (+), (*), abs, signum, fromInteger, (negate | (-)) #-}

#+END_SRC

Fractional

#+BEGIN_SRC haskell
class Num a => Fractional a where 
  (/) :: a -> a -> a
  recip :: a -> a
  fromRational :: Rational -> a
#+END_SRC

Eq

#+BEGIN_SRC haskell 
class Eq a where
  (==) :: a -> a -> Bool
  (/=) :: a -> a -> Bool
#+END_SRC

Ord 

#+BEGIN_SRC haskell
data Ordering = LT | EQ | GT

class Eq a => Ord a where
  compare :: a -> a -> Ordering
  (<) :: a -> a -> Bool
  (<=) :: a -> a -> Bool
  (>) :: a -> a -> Bool
  (>=) :: a -> a -> Bool
  max :: a -> a -> a
  min :: a -> a -> a
  {-# MINIMAL compare | (<=) #-}
#+END_SRC

Enum 

#+BEGIN_SRC haskell 
> :info Enum
class Enum a where
  succ :: a -> a
  pred :: a -> a
  toEnum :: Int -> a
  fromEnum :: a -> Int
  enumFrom :: a -> [a]
  enumFromThen :: a -> a -> [a]
  enumFromTo :: a -> a -> [a]
  enumFromThenTo :: a -> a -> a -> [a]
  {-# MINIMAL toEnum, fromEnum #-}
#+END_SRC

** Examples 
