haskell/polymorphism_and_typeclasses.html

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Typeclasses</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<b>Standard Typeclasses</b>
</p>

<ul class="org-ul">
<li><span class="underline">Num</span> - Numeric types. Defines numertic operators (+), (-), (*) and
functiosn abs and signum.

<ul class="org-ul">
<li>Methods:   (+), (-), (*), abs, signum 
</li>
<li>Standard Instances:
<ul class="org-ul">
<li>Int       - 29 bits Signed Integer
</li>
<li>Integer   - Arbitrary precision integer
</li>
<li>Float     - IEEE 32-bits Float point
</li>
<li>Double    - IEEE 64-bit Float Point
</li>
</ul>
</li>
</ul>
</li>

<li><span class="underline">Ord</span> - Comparison.
<ul class="org-ul">
<li>Operators: (&lt;) (&lt;=) (&gt;) (&gt;=) min and max 
</li>
</ul>
</li>

<li><span class="underline">Enum</span> - Enumeration. Allows syntax such as [1 &#x2026; 10], [0.5 .. 0.1 .. 10] ['a' .. 'z']
</li>

<li><span class="underline">Eq</span> - Equality.
<ul class="org-ul">
<li>Operator (<code>=) and (/</code>)
</li>
</ul>
</li>

<li><span class="underline">Show</span> - Defines method show, which converts an instance of this
type class to string.
</li>

<li><span class="underline">Read</span> - Defines the function read, which parses a string into a value.
</li>
</ul>


<p>
<b>Type Classes</b>
</p>

<p>
Num 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>info <span class="org-haskell-constructor">Num</span>
<span class="org-haskell-keyword">class</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-keyword">where</span>
  (<span class="org-haskell-operator">+</span>) <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a
  (<span class="org-haskell-operator">-</span>) <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a
  (<span class="org-haskell-operator">*</span>) <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a
  negate <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a
  abs <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a
  signum <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a
  fromInteger <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Integer</span> <span class="org-haskell-operator">-&gt;</span> a
  <span class="org-haskell-pragma">{-# MINIMAL (+), (*), abs, signum, fromInteger, (negate | (-)) #-}</span>
</pre>
</div>

<p>
Fractional
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">class</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Fractional</span> a <span class="org-haskell-keyword">where</span> 
  (<span class="org-haskell-operator">/</span>) <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a
  recip <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a
  fromRational <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Rational</span> <span class="org-haskell-operator">-&gt;</span> a
</pre>
</div>

<p>
Eq
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">class</span> <span class="org-haskell-type">Eq</span> a <span class="org-haskell-keyword">where</span>
  (<span class="org-haskell-operator">==</span>) <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Bool</span>
  (<span class="org-haskell-operator">/=</span>) <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Bool</span>
</pre>
</div>

<p>
Ord 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">data</span> <span class="org-haskell-type">Ordering</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">LT</span> <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">EQ</span> <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">GT</span>

<span class="org-haskell-keyword">class</span> <span class="org-haskell-type">Eq</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Ord</span> a <span class="org-haskell-keyword">where</span>
  compare <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Ordering</span>
  (<span class="org-haskell-operator">&lt;</span>) <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Bool</span>
  (<span class="org-haskell-operator">&lt;=</span>) <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Bool</span>
  (<span class="org-haskell-operator">&gt;</span>) <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Bool</span>
  (<span class="org-haskell-operator">&gt;=</span>) <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Bool</span>
  max <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a
  min <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a
  <span class="org-haskell-pragma">{-# MINIMAL compare | (&lt;=) #-}</span>
</pre>
</div>

<p>
Enum 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>info <span class="org-haskell-constructor">Enum</span>
<span class="org-haskell-keyword">class</span> <span class="org-haskell-type">Enum</span> a <span class="org-haskell-keyword">where</span>
  succ <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a
  pred <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a
  toEnum <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> a
  fromEnum <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Int</span>
  enumFrom <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> [a]
  enumFromThen <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> [a]
  enumFromTo <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> [a]
  enumFromThenTo <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> [a]
  <span class="org-haskell-pragma">{-# MINIMAL toEnum, fromEnum #-}</span>
</pre>
</div>
</div>
</div>
