haskell/polymorphism_and_typeclasses.org
*** Refactoring functions to work with many types

Example: Typeclasses allows writing generic functions that can be used
with all instances of a type class. In this example the function fun1
can be refactored to work with all instances of Num typeclass.

#+BEGIN_SRC haskell 
  :{
  fun1 :: Double -> Double -> Double
  fun1 x y = 2 * x + 4 * y         
  :}

   > fun1 3 4
  22.0
  it :: Double
  > fun1 3 4.23
  22.92
  it :: Double
  >

  > let a = 10 :: Int
  a :: Int
  > let c = 20 :: Int
  c :: Int
  > 
  > fun1 a b

  <interactive>:189:6: error:
      • Couldn't match expected type ‘Double’ with actual type ‘Int’
      • In the first argument of ‘fun1’, namely ‘a’
        In the expression: fun1 a b
        In an equation for ‘it’: it = fun1 a b

  <interactive>:189:8: error: Variable not in scope: b :: Double
  > 

  --- This function can be rewritten to work with
  --- all members of Num type class.

  :{
  fun :: Num a => a -> a -> a
  fun x y = 2 * x + 4 * y         
  :}

  > fun a c
  100
  it :: Int
  > fun 3.0 10.3
  47.2
  it :: Fractional a => a
  > 
   > let x = 10.4 :: Double
  x :: Double
  > let y = 20.5 :: Double
  y :: Double
  > fun x y 
  102.8
  it :: Double
  > 

#+END_SRC

Example: Generic monad combinator. The functions mapM2 applies a
function fn to two monad instances. 

#+BEGIN_SRC haskell 
  > :t (>>=)
  (>>=) :: Monad m => m a -> (a -> m b) -> m b
  > 
  > :t return
  return :: Monad m => a -> m a
  > 

  > :info Monad
  class Applicative m => Monad (m :: * -> *) where
    (>>=) :: m a -> (a -> m b) -> m b
    (>>) :: m a -> m b -> m b
    return :: a -> m a
    fail :: String -> m a
    {-# MINIMAL (>>=) #-}
          -- Defined in ‘GHC.Base’
  instance Monad (Either e) -- Defined in ‘Data.Either’
  instance Monad [] -- Defined in ‘GHC.Base’
  instance Monad Maybe -- Defined in ‘GHC.Base’
  instance Monad IO -- Defined in ‘GHC.Base’
  instance Monad ((->) r) -- Defined in ‘GHC.Base’
  instance Monoid a => Monad ((,) a) -- Defined in ‘GHC.Base’
  > 


  :{
  mapM2 :: (a -> b -> c) -> Maybe a -> Maybe b -> Maybe c
  mapM2 fn ma mb = do
    a <- ma
    b <- mb
    return $ fn a b
  :}


  :{
  mapM2a :: (a -> b -> c) -> Maybe a -> Maybe b -> Maybe c
  mapM2a fn ma mb = 
    ma >>= \ a ->
    mb >>= \ b -> return $ fn a b
  :}
   
   
  > mapM2 (+) (Just 10) (Just 4)
  Just 14
  it :: Num c => Maybe c
  > mapM2 (+) (Just 10) Nothing
  Nothing
  it :: Num c => Maybe c
  > mapM2 (+) Nothing (Just 4)
  Nothing
  it :: Num c => Maybe c
  > 

  > mapM2 (+) (Right 10) (Right 5)

  <interactive>:225:12: error:
      • Couldn't match expected type ‘Maybe c’
                    with actual type ‘Either a0 Integer’
      • In the second argument of ‘mapM2’, namely ‘(Right 10)’
        In the expression: mapM2 (+) (Right 10) (Right 5)
        In an equation for ‘it’: it = mapM2 (+) (Right 10) (Right 5)
      • Relevant bindings include

  > mapM2 (+) [1, 2, 3] [5, 6]

  <interactive>:227:11: error:
      • Couldn't match expected type ‘Maybe c’
                    with actual type ‘[Integer]’
      • In the second argument of ‘mapM2’, namely ‘[1, 2, 3]’
        In the expression: mapM2 (+) [1, 2, 3] [5, 6]
        In an equation for ‘it’: it = mapM2 (+) [1, 2, 3] [5, 6]
      • Relevant bindings include
          it :: Maybe c (bound at <interactive>:227:1)

  <interactive>:227:21: error:
      • Couldn't match expected type ‘Maybe c’
                    with actual type ‘[Integer]’
      • In the third argument of ‘mapM2’, namely ‘[5, 6]’
        In the expression: mapM2 (+) [1, 2, 3] [5, 6]
        In an equation for ‘it’: it = mapM2 (+) [1, 2, 3] [5, 6]
      • Relevant bindings include
          it :: Maybe c (bound at <interactive>:227:1)
  > 


  > mapM2a (+) (Just 10) (Just 15)
  Just 25
  it :: Num c => Maybe c
  > 
  > mapM2a (+) [1, 2, 3] [4, 5]

  <interactive>:258:12: error:
      • Couldn't match expected type ‘Maybe c’
                    with actual type ‘[Integer]’
      • In the second argument of ‘mapM2a’, namely ‘[1, 2, 3]’
        In the expression: mapM2a (+) [1, 2, 3] [4, 5]
        In an equation for ‘it’: it = mapM2a (+) [1, 2, 3] [4, 5]
      • Relevant bindings include
          it :: Maybe c (bound at <interactive>:258:1)

  --- This function can be rewritten to operate on any Monad instance

  :{
  mapM2 :: Monad m => (a -> b -> c) -> m a -> m b -> m c
  mapM2 fn ma mb = do
    a <- ma
    b <- mb
    return $ fn a b
  :}

  :{
  mapM2b :: Monad m => (a -> b -> c) -> m a -> m b -> m c
  mapM2b fn ma mb = 
    ma >>= \a -> 
    mb >>= \b -> 
    return $ fn a b
  :}
   

  > mapM2 (+) (Just 10) (Just 4)
  Just 14
  it :: Num c => Maybe c
        
  > mapM2 (,) [1, 2, 3] ["a", "b"]
  [(1,"a"),(1,"b"),(2,"a"),(2,"b"),(3,"a"),(3,"b")]
  it :: Num a => [(a, [Char])]
  >

  > mapM2 (+) (Right 10) (Right 4)
  Right 14
  it :: Num c => Either a c
        
  > mapM2 (+) (Right 10) (Left "Failed")
  Left "Failed"
  it :: Num c => Either [Char] c
  > 

  > mapM2b (+) (Just 10) (Just 5)
  Just 15
  it :: Num c => Maybe c
  > mapM2b (+) (Just 10) Nothing
  Nothing
  it :: Num c => Maybe c
  > mapM2b (+) (Right 10) (Right 5)
  Right 15
  it :: Num c => Either a c
  > 

#+END_SRC

