haskell/polymorphism_and_typeclasses.html

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Examples</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Refactoring functions to work with many types</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Example: Typeclasses allows writing generic functions that can be used
with all instances of a type class. In this example the function fun1
can be refactored to work with all instances of Num typeclass.
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-constructor">:</span>{
<span class="org-function-name">fun1</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Double</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Double</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Double</span>
<span class="org-haskell-definition">fun1</span> x y <span class="org-haskell-operator">=</span> 2 <span class="org-haskell-operator">*</span> x <span class="org-haskell-operator">+</span> 4 <span class="org-haskell-operator">*</span> y         
<span class="org-haskell-constructor">:</span>}

 <span class="org-haskell-operator">&gt;</span> fun1 3 4
22.0
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Double</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">fun1</span> 3 4.23
22.92
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Double</span>
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> a <span class="org-haskell-operator">=</span> 10 <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span>
<span class="org-function-name">a</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> c <span class="org-haskell-operator">=</span> 20 <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span>
<span class="org-function-name">c</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">fun1</span> a b

<span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>189<span class="org-haskell-type">:</span>6<span class="org-haskell-type">:</span> error<span class="org-haskell-type">:</span>
    <span class="org-haskell-operator">&#8226;</span> <span class="org-haskell-type">Couldn't</span> match expected <span class="org-haskell-keyword">type</span> &#8216;<span class="org-haskell-type">Double</span>&#8217; with actual <span class="org-haskell-keyword">type</span> &#8216;<span class="org-haskell-type">Int</span>&#8217;
    <span class="org-haskell-operator">&#8226;</span> <span class="org-haskell-type">In</span> the first argument <span class="org-haskell-keyword">of</span> &#8216;fun1&#8217;, namely &#8216;a&#8217;
      <span class="org-haskell-constructor">In</span> the expression<span class="org-haskell-constructor">:</span> fun1 a b
      <span class="org-haskell-constructor">In</span> an equation for &#8216;it&#8217;<span class="org-haskell-constructor">:</span> it <span class="org-haskell-operator">=</span> fun1 a b

<span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>189<span class="org-haskell-constructor">:</span>8<span class="org-haskell-constructor">:</span> error<span class="org-haskell-constructor">:</span> <span class="org-haskell-constructor">Variable</span> not <span class="org-haskell-keyword">in</span> scope<span class="org-haskell-constructor">:</span> b <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Double</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">--</span><span class="org-comment">- This function can be rewritten to work with</span>
<span class="org-comment-delimiter">--</span><span class="org-comment">- all members of Num type class.</span>

<span class="org-haskell-type">:</span>{
<span class="org-function-name">fun</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a
<span class="org-haskell-definition">fun</span> x y <span class="org-haskell-operator">=</span> 2 <span class="org-haskell-operator">*</span> x <span class="org-haskell-operator">+</span> 4 <span class="org-haskell-operator">*</span> y         
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">fun</span> a c
100
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">fun</span> 3.0 10.3
47.2
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Fractional</span> a <span class="org-haskell-operator">=&gt;</span> a
<span class="org-haskell-operator">&gt;</span> 
 <span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> x <span class="org-haskell-operator">=</span> 10.4 <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Double</span>
<span class="org-function-name">x</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Double</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> y <span class="org-haskell-operator">=</span> 20.5 <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Double</span>
<span class="org-function-name">y</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Double</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">fun</span> x y 
102.8
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Double</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
Example: Generic monad combinator. The functions mapM2 applies a
function fn to two monad instances. 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t (<span class="org-haskell-operator">&gt;&gt;=</span>)
(<span class="org-haskell-definition">&gt;&gt;=</span>) <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Monad</span> m <span class="org-haskell-operator">=&gt;</span> m a <span class="org-haskell-operator">-&gt;</span> (a <span class="org-haskell-operator">-&gt;</span> m b) <span class="org-haskell-operator">-&gt;</span> m b
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t return
<span class="org-function-name">return</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Monad</span> m <span class="org-haskell-operator">=&gt;</span> a <span class="org-haskell-operator">-&gt;</span> m a
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>info <span class="org-haskell-type">Monad</span>
<span class="org-haskell-keyword">class</span> <span class="org-haskell-type">Applicative</span> m <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Monad</span> (m <span class="org-haskell-operator">::</span> <span class="org-haskell-operator">*</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-operator">*</span>) <span class="org-haskell-keyword">where</span>
  (<span class="org-haskell-operator">&gt;&gt;=</span>) <span class="org-haskell-operator">::</span> m a <span class="org-haskell-operator">-&gt;</span> (a <span class="org-haskell-operator">-&gt;</span> m b) <span class="org-haskell-operator">-&gt;</span> m b
  (<span class="org-haskell-operator">&gt;&gt;</span>) <span class="org-haskell-operator">::</span> m a <span class="org-haskell-operator">-&gt;</span> m b <span class="org-haskell-operator">-&gt;</span> m b
  return <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> m a
  fail <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> m a
  <span class="org-haskell-pragma">{-# MINIMAL (&gt;&gt;=) #-}</span>
        <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;GHC.Base&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Monad</span> (<span class="org-haskell-type">Either</span> e) <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;Data.Either&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Monad</span> <span class="org-haskell-constructor">[]</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;GHC.Base&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Monad</span> <span class="org-haskell-type">Maybe</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;GHC.Base&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Monad</span> <span class="org-haskell-type">IO</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;GHC.Base&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Monad</span> (<span class="org-haskell-constructor">(-&gt;)</span> r) <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;GHC.Base&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Monoid</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Monad</span> (<span class="org-haskell-constructor">(,)</span> a) <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;GHC.Base&#8217;</span>
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-type">:</span>{
<span class="org-function-name">mapM2</span> <span class="org-haskell-operator">::</span> (a <span class="org-haskell-operator">-&gt;</span> b <span class="org-haskell-operator">-&gt;</span> c) <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Maybe</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Maybe</span> b <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Maybe</span> c
<span class="org-haskell-definition">mapM2</span> fn ma mb <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>
  a <span class="org-haskell-operator">&lt;-</span> ma
  b <span class="org-haskell-operator">&lt;-</span> mb
  return <span class="org-haskell-operator">$</span> fn a b
<span class="org-haskell-constructor">:</span>}


<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">mapM2a</span> <span class="org-haskell-operator">::</span> (a <span class="org-haskell-operator">-&gt;</span> b <span class="org-haskell-operator">-&gt;</span> c) <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Maybe</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Maybe</span> b <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Maybe</span> c
<span class="org-haskell-definition">mapM2a</span> fn ma mb <span class="org-haskell-operator">=</span> 
  ma <span class="org-haskell-operator">&gt;&gt;=</span> <span class="org-haskell-operator">\</span> a <span class="org-haskell-operator">-&gt;</span>
  mb <span class="org-haskell-operator">&gt;&gt;=</span> <span class="org-haskell-operator">\</span> b <span class="org-haskell-operator">-&gt;</span> return <span class="org-haskell-operator">$</span> fn a b
<span class="org-haskell-constructor">:</span>}


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapM2</span> (<span class="org-haskell-operator">+</span>) (<span class="org-haskell-constructor">Just</span> 10) (<span class="org-haskell-constructor">Just</span> 4)
<span class="org-haskell-constructor">Just</span> 14
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> c <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Maybe</span> c
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapM2</span> (<span class="org-haskell-operator">+</span>) (<span class="org-haskell-type">Just</span> 10) <span class="org-haskell-type">Nothing</span>
<span class="org-haskell-constructor">Nothing</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> c <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Maybe</span> c
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapM2</span> (<span class="org-haskell-operator">+</span>) <span class="org-haskell-type">Nothing</span> (<span class="org-haskell-type">Just</span> 4)
<span class="org-haskell-constructor">Nothing</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> c <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Maybe</span> c
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapM2</span> (<span class="org-haskell-operator">+</span>) (<span class="org-haskell-type">Right</span> 10) (<span class="org-haskell-type">Right</span> 5)

<span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>225<span class="org-haskell-type">:</span>12<span class="org-haskell-type">:</span> error<span class="org-haskell-type">:</span>
    <span class="org-haskell-operator">&#8226;</span> <span class="org-haskell-type">Couldn't</span> match expected <span class="org-haskell-keyword">type</span> &#8216;<span class="org-haskell-type">Maybe</span> c&#8217;
                  with actual <span class="org-haskell-keyword">type</span> &#8216;<span class="org-haskell-type">Either</span> a0 <span class="org-haskell-type">Integer</span>&#8217;
    <span class="org-haskell-operator">&#8226;</span> <span class="org-haskell-type">In</span> the second argument <span class="org-haskell-keyword">of</span> &#8216;mapM2&#8217;, namely &#8216;(<span class="org-haskell-constructor">Right</span> 10)&#8217;
      <span class="org-haskell-constructor">In</span> the expression<span class="org-haskell-constructor">:</span> mapM2 (<span class="org-haskell-operator">+</span>) (<span class="org-haskell-constructor">Right</span> 10) (<span class="org-haskell-constructor">Right</span> 5)
      <span class="org-haskell-constructor">In</span> an equation for &#8216;it&#8217;<span class="org-haskell-constructor">:</span> it <span class="org-haskell-operator">=</span> mapM2 (<span class="org-haskell-operator">+</span>) (<span class="org-haskell-constructor">Right</span> 10) (<span class="org-haskell-constructor">Right</span> 5)
    <span class="org-haskell-operator">&#8226;</span> <span class="org-haskell-constructor">Relevant</span> bindings include

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapM2</span> (<span class="org-haskell-operator">+</span>) [1, 2, 3] [5, 6]

<span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>227<span class="org-haskell-constructor">:</span>11<span class="org-haskell-constructor">:</span> error<span class="org-haskell-constructor">:</span>
    <span class="org-haskell-operator">&#8226;</span> <span class="org-haskell-constructor">Couldn't</span> match expected <span class="org-haskell-keyword">type</span> &#8216;<span class="org-haskell-type">Maybe</span> c&#8217;
                  with actual <span class="org-haskell-keyword">type</span> &#8216;[<span class="org-haskell-type">Integer</span>]&#8217;
    <span class="org-haskell-operator">&#8226;</span> <span class="org-haskell-type">In</span> the second argument <span class="org-haskell-keyword">of</span> &#8216;mapM2&#8217;, namely &#8216;[1, 2, 3]&#8217;
      <span class="org-haskell-constructor">In</span> the expression<span class="org-haskell-constructor">:</span> mapM2 (<span class="org-haskell-operator">+</span>) [1, 2, 3] [5, 6]
      <span class="org-haskell-constructor">In</span> an equation for &#8216;it&#8217;<span class="org-haskell-constructor">:</span> it <span class="org-haskell-operator">=</span> mapM2 (<span class="org-haskell-operator">+</span>) [1, 2, 3] [5, 6]
    <span class="org-haskell-operator">&#8226;</span> <span class="org-haskell-constructor">Relevant</span> bindings include
        it <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Maybe</span> c (bound at <span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>227<span class="org-haskell-type">:</span>1)

<span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>227<span class="org-haskell-type">:</span>21<span class="org-haskell-type">:</span> error<span class="org-haskell-type">:</span>
    <span class="org-haskell-operator">&#8226;</span> <span class="org-haskell-type">Couldn't</span> match expected <span class="org-haskell-keyword">type</span> &#8216;<span class="org-haskell-type">Maybe</span> c&#8217;
                  with actual <span class="org-haskell-keyword">type</span> &#8216;[<span class="org-haskell-type">Integer</span>]&#8217;
    <span class="org-haskell-operator">&#8226;</span> <span class="org-haskell-type">In</span> the third argument <span class="org-haskell-keyword">of</span> &#8216;mapM2&#8217;, namely &#8216;[5, 6]&#8217;
      <span class="org-haskell-constructor">In</span> the expression<span class="org-haskell-constructor">:</span> mapM2 (<span class="org-haskell-operator">+</span>) [1, 2, 3] [5, 6]
      <span class="org-haskell-constructor">In</span> an equation for &#8216;it&#8217;<span class="org-haskell-constructor">:</span> it <span class="org-haskell-operator">=</span> mapM2 (<span class="org-haskell-operator">+</span>) [1, 2, 3] [5, 6]
    <span class="org-haskell-operator">&#8226;</span> <span class="org-haskell-constructor">Relevant</span> bindings include
        it <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Maybe</span> c (bound at <span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>227<span class="org-haskell-type">:</span>1)
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapM2a</span> (<span class="org-haskell-operator">+</span>) (<span class="org-haskell-type">Just</span> 10) (<span class="org-haskell-type">Just</span> 15)
<span class="org-haskell-constructor">Just</span> 25
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> c <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Maybe</span> c
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapM2a</span> (<span class="org-haskell-operator">+</span>) [1, 2, 3] [4, 5]

<span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>258<span class="org-haskell-type">:</span>12<span class="org-haskell-type">:</span> error<span class="org-haskell-type">:</span>
    <span class="org-haskell-operator">&#8226;</span> <span class="org-haskell-type">Couldn't</span> match expected <span class="org-haskell-keyword">type</span> &#8216;<span class="org-haskell-type">Maybe</span> c&#8217;
                  with actual <span class="org-haskell-keyword">type</span> &#8216;[<span class="org-haskell-type">Integer</span>]&#8217;
    <span class="org-haskell-operator">&#8226;</span> <span class="org-haskell-type">In</span> the second argument <span class="org-haskell-keyword">of</span> &#8216;mapM2a&#8217;, namely &#8216;[1, 2, 3]&#8217;
      <span class="org-haskell-constructor">In</span> the expression<span class="org-haskell-constructor">:</span> mapM2a (<span class="org-haskell-operator">+</span>) [1, 2, 3] [4, 5]
      <span class="org-haskell-constructor">In</span> an equation for &#8216;it&#8217;<span class="org-haskell-constructor">:</span> it <span class="org-haskell-operator">=</span> mapM2a (<span class="org-haskell-operator">+</span>) [1, 2, 3] [4, 5]
    <span class="org-haskell-operator">&#8226;</span> <span class="org-haskell-constructor">Relevant</span> bindings include
        it <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Maybe</span> c (bound at <span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>258<span class="org-haskell-type">:</span>1)

<span class="org-comment-delimiter">--</span><span class="org-comment">- This function can be rewritten to operate on any Monad instance</span>

<span class="org-haskell-type">:</span>{
<span class="org-function-name">mapM2</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Monad</span> m <span class="org-haskell-operator">=&gt;</span> (a <span class="org-haskell-operator">-&gt;</span> b <span class="org-haskell-operator">-&gt;</span> c) <span class="org-haskell-operator">-&gt;</span> m a <span class="org-haskell-operator">-&gt;</span> m b <span class="org-haskell-operator">-&gt;</span> m c
<span class="org-haskell-definition">mapM2</span> fn ma mb <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>
  a <span class="org-haskell-operator">&lt;-</span> ma
  b <span class="org-haskell-operator">&lt;-</span> mb
  return <span class="org-haskell-operator">$</span> fn a b
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">mapM2b</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Monad</span> m <span class="org-haskell-operator">=&gt;</span> (a <span class="org-haskell-operator">-&gt;</span> b <span class="org-haskell-operator">-&gt;</span> c) <span class="org-haskell-operator">-&gt;</span> m a <span class="org-haskell-operator">-&gt;</span> m b <span class="org-haskell-operator">-&gt;</span> m c
<span class="org-haskell-definition">mapM2b</span> fn ma mb <span class="org-haskell-operator">=</span> 
  ma <span class="org-haskell-operator">&gt;&gt;=</span> <span class="org-haskell-operator">\</span>a <span class="org-haskell-operator">-&gt;</span> 
  mb <span class="org-haskell-operator">&gt;&gt;=</span> <span class="org-haskell-operator">\</span>b <span class="org-haskell-operator">-&gt;</span> 
  return <span class="org-haskell-operator">$</span> fn a b
<span class="org-haskell-constructor">:</span>}


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapM2</span> (<span class="org-haskell-operator">+</span>) (<span class="org-haskell-constructor">Just</span> 10) (<span class="org-haskell-constructor">Just</span> 4)
<span class="org-haskell-constructor">Just</span> 14
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> c <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Maybe</span> c

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapM2</span> <span class="org-haskell-constructor">(,)</span> [1, 2, 3] [<span class="org-string">"a"</span>, <span class="org-string">"b"</span>]
[(1,<span class="org-string">"a"</span>),(1,<span class="org-string">"b"</span>),(2,<span class="org-string">"a"</span>),(2,<span class="org-string">"b"</span>),(3,<span class="org-string">"a"</span>),(3,<span class="org-string">"b"</span>)]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> [(a, [<span class="org-haskell-type">Char</span>])]
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapM2</span> (<span class="org-haskell-operator">+</span>) (<span class="org-haskell-type">Right</span> 10) (<span class="org-haskell-type">Right</span> 4)
<span class="org-haskell-constructor">Right</span> 14
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> c <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Either</span> a c

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapM2</span> (<span class="org-haskell-operator">+</span>) (<span class="org-haskell-type">Right</span> 10) (<span class="org-haskell-type">Left</span> <span class="org-string">"Failed"</span>)
<span class="org-haskell-constructor">Left</span> <span class="org-string">"Failed"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> c <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Either</span> [<span class="org-haskell-type">Char</span>] c
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapM2b</span> (<span class="org-haskell-operator">+</span>) (<span class="org-haskell-type">Just</span> 10) (<span class="org-haskell-type">Just</span> 5)
<span class="org-haskell-constructor">Just</span> 15
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> c <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Maybe</span> c
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapM2b</span> (<span class="org-haskell-operator">+</span>) (<span class="org-haskell-type">Just</span> 10) <span class="org-haskell-type">Nothing</span>
<span class="org-haskell-constructor">Nothing</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> c <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Maybe</span> c
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapM2b</span> (<span class="org-haskell-operator">+</span>) (<span class="org-haskell-type">Right</span> 10) (<span class="org-haskell-type">Right</span> 5)
<span class="org-haskell-constructor">Right</span> 15
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> c <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Either</span> a c
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
