haskell/polymorphism_and_typeclasses.org
*** Defining typeclasses instances 
**** Defining a new instance of typeclass Functor 

#+BEGIN_SRC haskell 
  > data Identity a = Identity a deriving (Eq, Read, Show)
  data Identity a = Identity a

  > Identity 10
  Identity 10
  it :: Num a => Identity a

  > Identity "Hello world"
  Identity "Hello world"
  it :: Identity [Char]
  > 

  :{ 
  instance Functor Identity where
      fmap fn (Identity a) = Identity (fn a)
  :}

   
  > fmap (\x -> x + 1) (Identity 9)
  Identity 10
  it :: Num b => Identity b
        
  > fmap (\x -> x ++ " world") (Identity "Hello ")
  Identity "Hello  world"
  it :: Identity [Char]
  > 

#+END_SRC

