haskell/polymorphism_and_typeclasses.html

<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> Defining typeclasses instances</h4>
<div class="outline-text-4" id="text-1-3-2">
</div><div id="outline-container-sec-1-3-2-1" class="outline-5">
<h5 id="sec-1-3-2-1"><span class="section-number-5">1.3.2.1</span> Defining a new instance of typeclass Functor</h5>
<div class="outline-text-5" id="text-1-3-2-1">
<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">data</span> <span class="org-haskell-type">Identity</span> a <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Identity</span> a <span class="org-haskell-keyword">deriving</span> (<span class="org-haskell-constructor">Eq</span>, <span class="org-haskell-constructor">Read</span>, <span class="org-haskell-constructor">Show</span>)
<span class="org-haskell-keyword">data</span> <span class="org-haskell-type">Identity</span> a <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Identity</span> a

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">Identity</span> 10
<span class="org-haskell-constructor">Identity</span> 10
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Identity</span> a

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">Identity</span> <span class="org-string">"Hello world"</span>
<span class="org-haskell-constructor">Identity</span> <span class="org-string">"Hello world"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Identity</span> [<span class="org-haskell-type">Char</span>]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-type">:</span>{ 
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Functor</span> <span class="org-haskell-type">Identity</span> <span class="org-haskell-keyword">where</span>
    fmap fn (<span class="org-haskell-constructor">Identity</span> a) <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Identity</span> (fn a)
<span class="org-haskell-constructor">:</span>}


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">fmap</span> (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> x <span class="org-haskell-operator">+</span> 1) (<span class="org-haskell-constructor">Identity</span> 9)
<span class="org-haskell-constructor">Identity</span> 10
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> b <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Identity</span> b

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">fmap</span> (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> x <span class="org-haskell-operator">++</span> <span class="org-string">" world"</span>) (<span class="org-haskell-type">Identity</span> <span class="org-string">"Hello "</span>)
<span class="org-haskell-constructor">Identity</span> <span class="org-string">"Hello  world"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Identity</span> [<span class="org-haskell-type">Char</span>]
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
