haskell/polymorphism_and_typeclasses.org
**** Defining a new instance of type class Num.

#+BEGIN_SRC haskell 
  > :info Num
  class Num a where
    (+) :: a -> a -> a
    (-) :: a -> a -> a
    (*) :: a -> a -> a
    negate :: a -> a
    abs :: a -> a
    signum :: a -> a
    fromInteger :: Integer -> a
    {-# MINIMAL (+), (*), abs, signum, fromInteger, (negate | (-)) #-}
      -- Defined in ‘GHC.Num’
                   
  instance Num Word -- Defined in ‘GHC.Num’
  instance Num Integer -- Defined in ‘GHC.Num’
  instance Num Int -- Defined in ‘GHC.Num’
  instance Num Float -- Defined in ‘GHC.Float’
  instance Num Double -- Defined in ‘GHC.Float’
  > 


  > data Vector3D = Vector3D (Double, Double, Double) deriving (Eq, Read, Show)
  data Vector3D = Vector3D (Double, Double, Double)
  > 
               

  -- Extractors
  >  let vX (Vector3D (x, y, z)) = x 
  vX :: Vector3D -> Double
  >

  > let vY (Vector3D (x, y, z)) = y 
  vY :: Vector3D -> Double
  > 

  > let vZ (Vector3D (x, y, z)) = z
  vZ :: Vector3D -> Double
  > 

  -- Smart constructor 

  > let vec x y z = Vector3D (x, y, z)
  vec :: Double -> Double -> Double -> Vector3D
  >


  :{
  instance Num Vector3D where

      -- (+) :: Num a => a -> a -> a
      Vector3D (x1, y1, z1) + Vector3D (x2, y2, z2) =
          vec (x1 + x2) (y1 + y2) (z1 + z2)

      -- (*) :: Num a => a -> a -> a
      Vector3D (x1, y1, z1) * Vector3D (x2, y2, z2) =
           vec (x1 * x2) (y1 * y2) (z1 * z2)

      -- (-) :: Num a => a -> a -> a
      Vector3D (x1, y1, z1) - Vector3D (x2, y2, z2) =
          vec (x1 - x2) (y1 - y2) (z1 - z2)

      -- abs :: Num a => a -> a            
      abs (Vector3D (x1, y1, z1)) = vec (abs x1) (abs y1) (abs z1)

      -- Dummy operation for Vector3D - Don't care about this
      -- operation.
      --
      -- signum :: Num a => a -> a
      signum (Vector3D (x1, y1, z1)) =  Vector3D (-x1, -y1, -z1)

      -- Dummy operation
      --                                  
      -- fromInteger :: Num a => Integer -> a
      fromInteger x  = let a = fromIntegral x
                       in Vector3D (a, a, a)

  :}


  > let norm (Vector3D (x, y, z)) = sqrt (x * x + y * y + z * z)
  norm :: Vector3D -> Double
  >

  > let dist va vb = norm $ va - vb
  dist :: Vector3D -> Vector3D -> Double
  > 

  > let scale f (Vector3D (x, y, z)) = vec (f * x) (f * y) (f * z)
  scale :: Double -> Vector3D -> Vector3D
  > 

  --- Get unitary 3D vector with same direction as v
  :{
  versor v = scale f v
      where 
        f = 1.0 / norm v
  :}      
  versor :: Vector3D -> Vector3D
  >          

   
  > vec 1 2 3
  Vector3D (1.0,2.0,3.0)
  it :: Vector3D
  > 
  > vec 1 2 3 + vec 3 4 5
  Vector3D (4.0,6.0,8.0)
  it :: Vector3D
  > 
  > vec 1 2 3 * vec 3 4 5
  Vector3D (3.0,8.0,15.0)
  it :: Vector3D
  > 
  > vec 1 2 3 - vec 3 4 5
  Vector3D (-2.0,-2.0,-2.0)
  it :: Vector3D
  > 
  > vec 3 4 5 - vec 1 2 3
  Vector3D (2.0,2.0,2.0)
  it :: Vector3D
  > 
  > norm $ vec 1 2 3
  3.7416573867739413
  it :: Double
  > 

  > dist (vec 10 4 5.0) (vec 2 7 8)
  9.055385138137417
  it :: Double
  > 

  > fromInteger 15 :: Vector3D 
  Vector3D (15.0,15.0,15.0)
  it :: Vector3D
  > 

  > - (vec 1 2 3)
  Vector3D (-1.0,-2.0,-3.0)
  it :: Vector3D
  > 

  > let ux k = scale k (Vector3D (1, 0, 0))
  ux :: Double -> Vector3D
  > 
  > let uy k = scale k (Vector3D (0, 1, 0))
  uy :: Double -> Vector3D
  > 
  > let uz k = scale k (Vector3D (0, 0, 1))
  uz :: Double -> Vector3D
  > 
  > ux 10
  Vector3D (10.0,0.0,0.0)
  it :: Vector3D
  > 
  > ux 5.0
  Vector3D (5.0,0.0,0.0)
  it :: Vector3D
  > 
  > uz 9
  Vector3D (0.0,0.0,9.0)
  it :: Vector3D
  > 
  > ux 2 + uy 4 + uz 7
  Vector3D (2.0,4.0,7.0)
  it :: Vector3D
  > 

  -- Declare an instance of typeclass show to change the way a type is displayed.
  :{
  instance Show Vector3D where
      show (Vector3D (x, y, z)) =
          show $ "Vector = " ++ show x ++ "i + " ++ show y ++ "j + " ++ show z ++ "k"

  :}   

  > let v1 = Vector3D (4.5, 3.0, 2.0)
  v1 :: Vector3D
  > v1
  "Vector = 4.5i + 3.0j + 2.0k"
  it :: Vector3D
  > 
  > let v1 = Vector3D (4.5, -3.0, 2.0)
  v1 :: Vector3D
  > v1
  "Vector = 4.5i + -3.0j + 2.0k"
  it :: Vector3D
  > 

#+END_SRC

