haskell/polymorphism_and_typeclasses.html

<div id="outline-container-sec-1-3-2-2" class="outline-5">
<h5 id="sec-1-3-2-2"><span class="section-number-5">1.3.2.2</span> Defining a new instance of typeclass Num.</h5>
<div class="outline-text-5" id="text-1-3-2-2">
<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>info <span class="org-haskell-constructor">Num</span>
<span class="org-haskell-keyword">class</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-keyword">where</span>
  (<span class="org-haskell-operator">+</span>) <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a
  (<span class="org-haskell-operator">-</span>) <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a
  (<span class="org-haskell-operator">*</span>) <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a
  negate <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a
  abs <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a
  signum <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a
  fromInteger <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Integer</span> <span class="org-haskell-operator">-&gt;</span> a
  <span class="org-haskell-pragma">{-# MINIMAL (+), (*), abs, signum, fromInteger, (negate | (-)) #-}</span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;GHC.Num&#8217;</span>

<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Num</span> <span class="org-haskell-type">Word</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;GHC.Num&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Num</span> <span class="org-haskell-type">Integer</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;GHC.Num&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Num</span> <span class="org-haskell-type">Int</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;GHC.Num&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Num</span> <span class="org-haskell-type">Float</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;GHC.Float&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Num</span> <span class="org-haskell-type">Double</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;GHC.Float&#8217;</span>
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">data</span> <span class="org-haskell-type">Vector3D</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Vector3D</span> (<span class="org-haskell-constructor">Double</span>, <span class="org-haskell-constructor">Double</span>, <span class="org-haskell-constructor">Double</span>) <span class="org-haskell-keyword">deriving</span> (<span class="org-haskell-constructor">Eq</span>, <span class="org-haskell-constructor">Read</span>, <span class="org-haskell-constructor">Show</span>)
<span class="org-haskell-keyword">data</span> <span class="org-haskell-type">Vector3D</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Vector3D</span> (<span class="org-haskell-constructor">Double</span>, <span class="org-haskell-constructor">Double</span>, <span class="org-haskell-constructor">Double</span>)
<span class="org-haskell-operator">&gt;</span> 


<span class="org-comment-delimiter">-- </span><span class="org-comment">Extractors</span>
<span class="org-haskell-operator">&gt;</span>  <span class="org-haskell-keyword">let</span> vX (<span class="org-haskell-constructor">Vector3D</span> (x, y, z)) <span class="org-haskell-operator">=</span> x 
<span class="org-function-name">vX</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Vector3D</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Double</span>
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> vY (<span class="org-haskell-constructor">Vector3D</span> (x, y, z)) <span class="org-haskell-operator">=</span> y 
<span class="org-function-name">vY</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Vector3D</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Double</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> vZ (<span class="org-haskell-constructor">Vector3D</span> (x, y, z)) <span class="org-haskell-operator">=</span> z
<span class="org-function-name">vZ</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Vector3D</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Double</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">-- </span><span class="org-comment">Smart constructor </span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> vec x y z <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Vector3D</span> (x, y, z)
<span class="org-function-name">vec</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Double</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Double</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Double</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Vector3D</span>
<span class="org-haskell-operator">&gt;</span>


<span class="org-haskell-type">:</span>{
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Num</span> <span class="org-haskell-type">Vector3D</span> <span class="org-haskell-keyword">where</span>

    <span class="org-comment-delimiter">-- </span><span class="org-comment">(+) :: Num a =&gt; a -&gt; a -&gt; a</span>
    <span class="org-haskell-constructor">Vector3D</span> (x1, y1, z1) <span class="org-haskell-operator">+</span> <span class="org-haskell-constructor">Vector3D</span> (x2, y2, z2) <span class="org-haskell-operator">=</span>
        vec (x1 <span class="org-haskell-operator">+</span> x2) (y1 <span class="org-haskell-operator">+</span> y2) (z1 <span class="org-haskell-operator">+</span> z2)

    <span class="org-comment-delimiter">-- </span><span class="org-comment">(*) :: Num a =&gt; a -&gt; a -&gt; a</span>
    <span class="org-haskell-constructor">Vector3D</span> (x1, y1, z1) <span class="org-haskell-operator">*</span> <span class="org-haskell-constructor">Vector3D</span> (x2, y2, z2) <span class="org-haskell-operator">=</span>
         vec (x1 <span class="org-haskell-operator">*</span> x2) (y1 <span class="org-haskell-operator">*</span> y2) (z1 <span class="org-haskell-operator">*</span> z2)

    <span class="org-comment-delimiter">-- </span><span class="org-comment">(-) :: Num a =&gt; a -&gt; a -&gt; a</span>
    <span class="org-haskell-constructor">Vector3D</span> (x1, y1, z1) <span class="org-haskell-operator">-</span> <span class="org-haskell-constructor">Vector3D</span> (x2, y2, z2) <span class="org-haskell-operator">=</span>
        vec (x1 <span class="org-haskell-operator">-</span> x2) (y1 <span class="org-haskell-operator">-</span> y2) (z1 <span class="org-haskell-operator">-</span> z2)

    <span class="org-comment-delimiter">-- </span><span class="org-comment">abs :: Num a =&gt; a -&gt; a            </span>
    abs (<span class="org-haskell-constructor">Vector3D</span> (x1, y1, z1)) <span class="org-haskell-operator">=</span> vec (abs x1) (abs y1) (abs z1)

    <span class="org-comment-delimiter">-- </span><span class="org-comment">Dummy operation for Vector3D - Don't care about this</span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">operation.</span>
    <span class="org-comment-delimiter">--</span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">signum :: Num a =&gt; a -&gt; a</span>
    signum (<span class="org-haskell-constructor">Vector3D</span> (x1, y1, z1)) <span class="org-haskell-operator">=</span>  <span class="org-haskell-constructor">Vector3D</span> (<span class="org-haskell-operator">-</span>x1, <span class="org-haskell-operator">-</span>y1, <span class="org-haskell-operator">-</span>z1)

    <span class="org-comment-delimiter">-- </span><span class="org-comment">Dummy operation</span>
    <span class="org-comment-delimiter">--                                  </span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">fromInteger :: Num a =&gt; Integer -&gt; a</span>
    fromInteger x  <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">let</span> a <span class="org-haskell-operator">=</span> fromIntegral x
                     <span class="org-haskell-keyword">in</span> <span class="org-haskell-constructor">Vector3D</span> (a, a, a)

<span class="org-haskell-constructor">:</span>}


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> norm (<span class="org-haskell-constructor">Vector3D</span> (x, y, z)) <span class="org-haskell-operator">=</span> sqrt (x <span class="org-haskell-operator">*</span> x <span class="org-haskell-operator">+</span> y <span class="org-haskell-operator">*</span> y <span class="org-haskell-operator">+</span> z <span class="org-haskell-operator">*</span> z)
<span class="org-function-name">norm</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Vector3D</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Double</span>
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> dist va vb <span class="org-haskell-operator">=</span> norm <span class="org-haskell-operator">$</span> va <span class="org-haskell-operator">-</span> vb
<span class="org-function-name">dist</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Vector3D</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Vector3D</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Double</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> scale f (<span class="org-haskell-constructor">Vector3D</span> (x, y, z)) <span class="org-haskell-operator">=</span> vec (f <span class="org-haskell-operator">*</span> x) (f <span class="org-haskell-operator">*</span> y) (f <span class="org-haskell-operator">*</span> z)
<span class="org-function-name">scale</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Double</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Vector3D</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Vector3D</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">--</span><span class="org-comment">- Get unitary 3D vector with same direction as v</span>
<span class="org-haskell-type">:</span>{
<span class="org-haskell-definition">versor</span> v <span class="org-haskell-operator">=</span> scale f v
    <span class="org-haskell-keyword">where</span> 
      f <span class="org-haskell-operator">=</span> 1.0 <span class="org-haskell-operator">/</span> norm v
<span class="org-haskell-constructor">:</span>}      
<span class="org-function-name">versor</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Vector3D</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Vector3D</span>
<span class="org-haskell-operator">&gt;</span>          


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">vec</span> 1 2 3
<span class="org-haskell-constructor">Vector3D</span> (1.0,2.0,3.0)
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Vector3D</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">vec</span> 1 2 3 <span class="org-haskell-operator">+</span> vec 3 4 5
<span class="org-haskell-constructor">Vector3D</span> (4.0,6.0,8.0)
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Vector3D</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">vec</span> 1 2 3 <span class="org-haskell-operator">*</span> vec 3 4 5
<span class="org-haskell-constructor">Vector3D</span> (3.0,8.0,15.0)
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Vector3D</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">vec</span> 1 2 3 <span class="org-haskell-operator">-</span> vec 3 4 5
<span class="org-haskell-constructor">Vector3D</span> (<span class="org-haskell-operator">-</span>2.0,<span class="org-haskell-operator">-</span>2.0,<span class="org-haskell-operator">-</span>2.0)
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Vector3D</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">vec</span> 3 4 5 <span class="org-haskell-operator">-</span> vec 1 2 3
<span class="org-haskell-constructor">Vector3D</span> (2.0,2.0,2.0)
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Vector3D</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> norm <span class="org-haskell-definition">$</span> vec 1 2 3
3.7416573867739413
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Double</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">dist</span> (vec 10 4 5.0) (vec 2 7 8)
9.055385138137417
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Double</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">fromInteger</span> 15 <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Vector3D</span> 
<span class="org-haskell-constructor">Vector3D</span> (15.0,15.0,15.0)
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Vector3D</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-operator">-</span> (vec 1 2 3)
<span class="org-haskell-constructor">Vector3D</span> (<span class="org-haskell-operator">-</span>1.0,<span class="org-haskell-operator">-</span>2.0,<span class="org-haskell-operator">-</span>3.0)
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Vector3D</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> ux k <span class="org-haskell-operator">=</span> scale k (<span class="org-haskell-constructor">Vector3D</span> (1, 0, 0))
<span class="org-function-name">ux</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Double</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Vector3D</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> uy k <span class="org-haskell-operator">=</span> scale k (<span class="org-haskell-constructor">Vector3D</span> (0, 1, 0))
<span class="org-function-name">uy</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Double</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Vector3D</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> uz k <span class="org-haskell-operator">=</span> scale k (<span class="org-haskell-constructor">Vector3D</span> (0, 0, 1))
<span class="org-function-name">uz</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Double</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Vector3D</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">ux</span> 10
<span class="org-haskell-constructor">Vector3D</span> (10.0,0.0,0.0)
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Vector3D</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">ux</span> 5.0
<span class="org-haskell-constructor">Vector3D</span> (5.0,0.0,0.0)
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Vector3D</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">uz</span> 9
<span class="org-haskell-constructor">Vector3D</span> (0.0,0.0,9.0)
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Vector3D</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">ux</span> 2 <span class="org-haskell-operator">+</span> uy 4 <span class="org-haskell-operator">+</span> uz 7
<span class="org-haskell-constructor">Vector3D</span> (2.0,4.0,7.0)
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Vector3D</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">-- </span><span class="org-comment">Declare an instance of typeclass show to change the way a type is displayed.</span>
<span class="org-haskell-type">:</span>{
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Show</span> <span class="org-haskell-type">Vector3D</span> <span class="org-haskell-keyword">where</span>
    show (<span class="org-haskell-constructor">Vector3D</span> (x, y, z)) <span class="org-haskell-operator">=</span>
        show <span class="org-haskell-operator">$</span> <span class="org-string">"Vector = "</span> <span class="org-haskell-operator">++</span> show x <span class="org-haskell-operator">++</span> <span class="org-string">"i + "</span> <span class="org-haskell-operator">++</span> show y <span class="org-haskell-operator">++</span> <span class="org-string">"j + "</span> <span class="org-haskell-operator">++</span> show z <span class="org-haskell-operator">++</span> <span class="org-string">"k"</span>

<span class="org-haskell-constructor">:</span>}   

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> v1 <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Vector3D</span> (4.5, 3.0, 2.0)
<span class="org-function-name">v1</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Vector3D</span>
<span class="org-haskell-operator">&gt;</span> v1
<span class="org-string">"Vector = 4.5i + 3.0j + 2.0k"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Vector3D</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> v1 <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Vector3D</span> (4.5, <span class="org-haskell-operator">-</span>3.0, 2.0)
<span class="org-function-name">v1</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Vector3D</span>
<span class="org-haskell-operator">&gt;</span> v1
<span class="org-string">"Vector = 4.5i + -3.0j + 2.0k"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Vector3D</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
