haskell/polymorphism_and_typeclasses.html

<div id="outline-container-sec-1-3-2-3" class="outline-5">
<h5 id="sec-1-3-2-3"><span class="section-number-5">1.3.2.3</span> Complex Number Implementation</h5>
<div class="outline-text-5" id="text-1-3-2-3">
<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Text.Printf</span> (printf)



<span class="org-comment-delimiter">-- </span><span class="org-comment">Complex number in rectangular form</span>
<span class="org-comment-delimiter">-- </span>
<span class="org-haskell-keyword">data</span> <span class="org-haskell-type">Cpl</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Cpl</span> <span class="org-haskell-constructor">Double</span> <span class="org-haskell-constructor">Double</span> <span class="org-haskell-keyword">deriving</span> (<span class="org-haskell-constructor">Eq</span>, <span class="org-haskell-constructor">Read</span>)


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> real (<span class="org-haskell-constructor">Cpl</span> x y) <span class="org-haskell-operator">=</span> x 
<span class="org-function-name">real</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Cpl</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Double</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> imag (<span class="org-haskell-constructor">Cpl</span> x y) <span class="org-haskell-operator">=</span> y 
<span class="org-function-name">imag</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Cpl</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Double</span>
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> rad2deg rad <span class="org-haskell-operator">=</span> 180 <span class="org-haskell-operator">/</span> pi <span class="org-haskell-operator">*</span> rad 
<span class="org-function-name">rad2deg</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Floating</span> a <span class="org-haskell-operator">=&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> deg2rad deg <span class="org-haskell-operator">=</span> pi <span class="org-haskell-operator">/</span> 180 <span class="org-haskell-operator">*</span> deg
<span class="org-function-name">deg2rad</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Floating</span> a <span class="org-haskell-operator">=&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">-- </span><span class="org-comment">Magnitude </span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> mag (<span class="org-haskell-constructor">Cpl</span> x y) <span class="org-haskell-operator">=</span> sqrt ( x <span class="org-haskell-operator">*</span> x <span class="org-haskell-operator">+</span> y <span class="org-haskell-operator">*</span> y)
<span class="org-function-name">mag</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Cpl</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Double</span>

<span class="org-comment-delimiter">-- </span><span class="org-comment">Angle </span>
<span class="org-haskell-keyword">let</span> phase (<span class="org-haskell-constructor">Cpl</span> x y) <span class="org-haskell-operator">=</span> rad2deg <span class="org-haskell-operator">$</span> atan2 y x 


<span class="org-comment-delimiter">-- </span><span class="org-comment">Complex in polar form with angle in degrees.                       </span>
<span class="org-haskell-constructor">:</span>{
<span class="org-haskell-keyword">let</span> polard r a <span class="org-haskell-operator">=</span>
        <span class="org-haskell-keyword">let</span> ar <span class="org-haskell-operator">=</span> deg2rad a <span class="org-comment-delimiter">-- </span><span class="org-comment">angle in radians</span>
        <span class="org-haskell-keyword">in</span> <span class="org-haskell-constructor">Cpl</span> (r <span class="org-haskell-operator">*</span> cos ar) (r <span class="org-haskell-operator">*</span> sin ar)
<span class="org-haskell-constructor">:</span>}


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> (<span class="org-haskell-operator">+.</span>) x y <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Cpl</span> x y
(<span class="org-haskell-definition">+.</span>) <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Double</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Double</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Cpl</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> (<span class="org-haskell-operator">&lt;@</span>) r a <span class="org-haskell-operator">=</span> polard r a
(<span class="org-haskell-definition">&lt;@</span>) <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Double</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Double</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Cpl</span>
<span class="org-haskell-operator">&gt;</span> 



<span class="org-haskell-type">:</span>{         
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Show</span> <span class="org-haskell-type">Cpl</span> <span class="org-haskell-keyword">where</span>
    show (<span class="org-haskell-constructor">Cpl</span> x y) <span class="org-haskell-operator">=</span> printf <span class="org-string">"%.3f + %.3fj"</span> x y 
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-constructor">:</span>{ 
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Num</span> <span class="org-haskell-type">Cpl</span> <span class="org-haskell-keyword">where</span>
    (<span class="org-haskell-constructor">Cpl</span> x1 y1) <span class="org-haskell-operator">+</span> (<span class="org-haskell-constructor">Cpl</span> x2 y2) <span class="org-haskell-operator">=</span>
        <span class="org-haskell-constructor">Cpl</span> (x1 <span class="org-haskell-operator">+</span> x2) (y1 <span class="org-haskell-operator">+</span> y2)

    (<span class="org-haskell-constructor">Cpl</span> x1 y1) <span class="org-haskell-operator">-</span> (<span class="org-haskell-constructor">Cpl</span> x2 y2) <span class="org-haskell-operator">=</span>
        <span class="org-haskell-constructor">Cpl</span> (x1 <span class="org-haskell-operator">-</span> x2) (y1 <span class="org-haskell-operator">-</span> y2)

    <span class="org-comment-delimiter">{- </span><span class="org-comment">(x1 + y1*j)(x2 + y2*j) = x1 x2 + x1 y2 j + y1 x2 j + y1 y2 j j </span>
<span class="org-comment">                              = (x1 x2 - y1y2) + (x1 y2 + y1 x2)j</span>
<span class="org-comment">    -}</span>                            
    (<span class="org-haskell-constructor">Cpl</span> x1 y1) <span class="org-haskell-operator">*</span> (<span class="org-haskell-constructor">Cpl</span> x2 y2) <span class="org-haskell-operator">=</span>
        <span class="org-haskell-constructor">Cpl</span> (x1 <span class="org-haskell-operator">*</span> x2 <span class="org-haskell-operator">-</span> y1 <span class="org-haskell-operator">*</span> y2) (x1 <span class="org-haskell-operator">*</span> y2 <span class="org-haskell-operator">+</span> y1 <span class="org-haskell-operator">*</span> x2)

    negate (<span class="org-haskell-constructor">Cpl</span> x y) <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Cpl</span> (<span class="org-haskell-operator">-</span>x) (<span class="org-haskell-operator">-</span>y)

    abs (<span class="org-haskell-constructor">Cpl</span> x y) <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Cpl</span> (sqrt <span class="org-haskell-operator">$</span> x <span class="org-haskell-operator">*</span> x <span class="org-haskell-operator">+</span> y <span class="org-haskell-operator">*</span> y) 0                   

    signum (<span class="org-haskell-constructor">Cpl</span> x y) <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Cpl</span> (signum x) 0

    fromInteger x <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Cpl</span> (fromIntegral x) 0 
<span class="org-haskell-constructor">:</span>}


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>info <span class="org-haskell-constructor">Fractional</span>
<span class="org-haskell-keyword">class</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Fractional</span> a <span class="org-haskell-keyword">where</span>
  (<span class="org-haskell-operator">/</span>) <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a
  recip <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a
  fromRational <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Rational</span> <span class="org-haskell-operator">-&gt;</span> a
  <span class="org-haskell-pragma">{-# MINIMAL fromRational, (recip | (/)) #-}</span>
        <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;GHC.Real&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Fractional</span> <span class="org-haskell-type">Float</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;GHC.Float&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Fractional</span> <span class="org-haskell-type">Double</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;GHC.Float&#8217;</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-type">:</span>{
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Fractional</span> <span class="org-haskell-type">Cpl</span> <span class="org-haskell-keyword">where</span>
    recip (<span class="org-haskell-constructor">Cpl</span> x y) <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">let</span> s <span class="org-haskell-operator">=</span> x <span class="org-haskell-operator">*</span> x <span class="org-haskell-operator">+</span> y <span class="org-haskell-operator">*</span> y
                      <span class="org-haskell-keyword">in</span>  <span class="org-haskell-constructor">Cpl</span> (x <span class="org-haskell-operator">/</span> s) (<span class="org-haskell-operator">-</span> y <span class="org-haskell-operator">/</span> s)

    fromRational x <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Cpl</span> 1.0 0 <span class="org-comment-delimiter">-- </span><span class="org-comment">Dummy operation to satisfy the type class                      </span>
<span class="org-haskell-constructor">:</span>}   


<span class="org-haskell-operator">&gt;</span> 10 <span class="org-haskell-operator">+.</span> 4
10.000 <span class="org-haskell-operator">+</span> 4.000j
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Cpl</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> 20.0 <span class="org-haskell-operator">&lt;@</span> 45.0
14.142 <span class="org-haskell-operator">+</span> 14.142j
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Cpl</span>
<span class="org-haskell-operator">&gt;</span> 10.0 <span class="org-haskell-operator">&lt;@</span> 60.0
5.000 <span class="org-haskell-operator">+</span> 8.660j
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Cpl</span>
<span class="org-haskell-operator">&gt;</span> 10.0 <span class="org-haskell-operator">&lt;@</span> 30.0
8.660 <span class="org-haskell-operator">+</span> 5.000j
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Cpl</span>
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">polard</span> 2.0 (<span class="org-haskell-operator">-</span>135.0)
<span class="org-haskell-operator">-</span>1.414 <span class="org-haskell-operator">+</span> <span class="org-haskell-operator">-</span>1.414j
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Cpl</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> phase <span class="org-haskell-definition">$</span> polard 2.0 (<span class="org-haskell-operator">-</span>135.0)
<span class="org-haskell-operator">-</span>135.0
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Double</span>
<span class="org-haskell-operator">&gt;</span> mag <span class="org-haskell-definition">$</span> polard 2.0 (<span class="org-haskell-operator">-</span>135.0)
2.0
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Double</span>
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">Cpl</span> 3.0 (<span class="org-haskell-operator">-</span>4.0)
3.000 <span class="org-haskell-operator">+</span> <span class="org-haskell-operator">-</span>4.000j
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Cpl</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">Cpl</span> 3.0 4.0 
3.000 <span class="org-haskell-operator">+</span> 4.000j
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Cpl</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">Cpl</span> 3.0 0.0
3.000 <span class="org-haskell-operator">+</span> 0.000j
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Cpl</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">Cpl</span> 10 3 <span class="org-haskell-operator">+</span> <span class="org-haskell-type">Cpl</span> 4 5
14.000 <span class="org-haskell-operator">+</span> 8.000j
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Cpl</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">Cpl</span> 10 3 <span class="org-haskell-operator">*</span> <span class="org-haskell-type">Cpl</span> 4 5
25.000 <span class="org-haskell-operator">+</span> 62.000j
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Cpl</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">Cpl</span> 0 1 <span class="org-haskell-operator">*</span> <span class="org-haskell-type">Cpl</span> 0 1
<span class="org-haskell-operator">-</span>1.000 <span class="org-haskell-operator">+</span> 0.000j
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Cpl</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> c1 <span class="org-haskell-operator">=</span> 10 <span class="org-haskell-operator">+.</span> 20
<span class="org-function-name">c1</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Cpl</span>
<span class="org-haskell-operator">&gt;</span> c1
10.000 <span class="org-haskell-operator">+</span> 20.000j
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Cpl</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> c2 <span class="org-haskell-operator">=</span> 5 <span class="org-haskell-operator">+.</span> 0 
<span class="org-function-name">c2</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Cpl</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> c3 <span class="org-haskell-operator">=</span> 10.0 <span class="org-haskell-operator">&lt;@</span> 30.0 
<span class="org-function-name">c3</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Cpl</span>
<span class="org-haskell-operator">&gt;</span> c3
8.660 <span class="org-haskell-operator">+</span> 5.000j
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Cpl</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> mag <span class="org-haskell-definition">$</span> recip c3 
0.1
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Double</span>
<span class="org-haskell-operator">&gt;</span> phase <span class="org-haskell-definition">$</span> recip c3 
<span class="org-haskell-operator">-</span>29.999999999999993
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Double</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> c1 <span class="org-haskell-definition">/</span> c2 
2.000 <span class="org-haskell-operator">+</span> 4.000j
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Cpl</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> c1 <span class="org-haskell-definition">/</span> c3 
1.866 <span class="org-haskell-operator">+</span> 1.232j
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Cpl</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
