haskell/polymorphism_and_typeclasses.html

<div id="outline-container-sec-1-3-2-4" class="outline-5">
<h5 id="sec-1-3-2-4"><span class="section-number-5">1.3.2.4</span> Vector Arithmetic</h5>
<div class="outline-text-5" id="text-1-3-2-4">
<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">data</span> <span class="org-haskell-type">Vector</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Vector</span> [<span class="org-haskell-constructor">Double</span>] <span class="org-haskell-keyword">deriving</span> (<span class="org-haskell-constructor">Eq</span>, <span class="org-haskell-constructor">Read</span>, <span class="org-haskell-constructor">Show</span>)

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t uncurry
<span class="org-function-name">uncurry</span> <span class="org-haskell-operator">::</span> (a <span class="org-haskell-operator">-&gt;</span> b <span class="org-haskell-operator">-&gt;</span> c) <span class="org-haskell-operator">-&gt;</span> (a, b) <span class="org-haskell-operator">-&gt;</span> c
<span class="org-haskell-operator">&gt;</span>               

<span class="org-haskell-type">:</span>{ 
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Num</span> <span class="org-haskell-type">Vector</span> <span class="org-haskell-keyword">where</span>   

    (<span class="org-haskell-constructor">Vector</span> xs) <span class="org-haskell-operator">+</span> (<span class="org-haskell-constructor">Vector</span> ys) <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Vector</span> <span class="org-haskell-operator">$</span> map (uncurry (<span class="org-haskell-operator">+</span>)) (zip xs ys)

    (<span class="org-haskell-constructor">Vector</span> xs) <span class="org-haskell-operator">-</span> (<span class="org-haskell-constructor">Vector</span> ys) <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Vector</span> <span class="org-haskell-operator">$</span> map (uncurry (<span class="org-haskell-operator">-</span>)) (zip xs ys)

    (<span class="org-haskell-constructor">Vector</span> xs) <span class="org-haskell-operator">*</span> (<span class="org-haskell-constructor">Vector</span> ys) <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Vector</span> <span class="org-haskell-operator">$</span> map (uncurry (<span class="org-haskell-operator">*</span>)) (zip xs ys)                                

    negate (<span class="org-haskell-constructor">Vector</span> xs) <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Vector</span> <span class="org-haskell-operator">$</span> map (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-operator">-</span>1.0 <span class="org-haskell-operator">*</span> x) xs

    abs (<span class="org-haskell-constructor">Vector</span> xs) <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Vector</span> <span class="org-haskell-operator">$</span> map abs xs

    signum (<span class="org-haskell-constructor">Vector</span> xs) <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Vector</span> <span class="org-haskell-operator">$</span> map signum xs

    <span class="org-comment-delimiter">-- </span><span class="org-comment">Dummy operation (Don't care)                      </span>
    fromInteger x <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Vector</span> [fromIntegral x]
<span class="org-haskell-constructor">:</span>}



<span class="org-haskell-constructor">:</span>{
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Fractional</span> <span class="org-haskell-type">Vector</span> <span class="org-haskell-keyword">where</span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">recip (Vector xs) = Vector $ map (\x -&gt; 1 / x) xs</span>
    <span class="org-comment-delimiter">--</span><span class="org-comment">- Or</span>
    (<span class="org-haskell-constructor">Vector</span> xs) <span class="org-haskell-operator">/</span> (<span class="org-haskell-constructor">Vector</span> ys) <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Vector</span> <span class="org-haskell-operator">$</span> map (uncurry (<span class="org-haskell-operator">/</span>)) (zip xs ys)    

    <span class="org-comment-delimiter">-- </span><span class="org-comment">Dummy operation - Don't care</span>
    fromRational x <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Vector</span> [fromRational x]
<span class="org-haskell-constructor">:</span>}   

<span class="org-haskell-keyword">let</span> apply fn (<span class="org-haskell-constructor">Vector</span> xs) <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Vector</span> (map fn xs)


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> scale k <span class="org-haskell-operator">=</span> apply (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> x <span class="org-haskell-operator">*</span> k)
<span class="org-function-name">scale</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Double</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Vector</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Vector</span>


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> repeatv x size <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Vector</span> (take size <span class="org-haskell-operator">$</span> repeat x)
<span class="org-function-name">repeatv</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Double</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Vector</span>
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>info <span class="org-haskell-type">Floating</span>
<span class="org-haskell-keyword">class</span> <span class="org-haskell-type">Fractional</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Floating</span> a <span class="org-haskell-keyword">where</span>
  pi <span class="org-haskell-operator">::</span> a
  exp <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a
  log <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a
  sqrt <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a
  (<span class="org-haskell-operator">**</span>) <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a
  logBase <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a
  sin <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a
  cos <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a
  tan <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a
  asin <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a
  acos <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a
  atan <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a
  sinh <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a
  cosh <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a
  tanh <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a
  asinh <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a
  acosh <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a
  atanh <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a
  GHC.Float.log1p <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a
  GHC.Float.expm1 <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a
  GHC.Float.log1pexp <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a
  GHC.Float.log1mexp <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a
  <span class="org-haskell-pragma">{-# MINIMAL pi, exp, log, sin, cos, asin, acos, atan, sinh, cosh,</span>
<span class="org-haskell-pragma">              asinh, acosh, atanh #-}</span>
        <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;GHC.Float&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Floating</span> <span class="org-haskell-type">Float</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;GHC.Float&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Floating</span> <span class="org-haskell-type">Double</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;GHC.Float&#8217;</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-type">:</span>{
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Floating</span> <span class="org-haskell-type">Vector</span> <span class="org-haskell-keyword">where</span>
    pi                    <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Vector</span> <span class="org-haskell-operator">$</span> repeat pi
    exp  (<span class="org-haskell-constructor">Vector</span> xs)      <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Vector</span> (map exp xs)
    log  (<span class="org-haskell-constructor">Vector</span> xs)      <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Vector</span> (map log xs)
    sqrt  (<span class="org-haskell-constructor">Vector</span> xs)     <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Vector</span> (map sqrt xs)

    (<span class="org-haskell-operator">**</span>) (<span class="org-haskell-constructor">Vector</span> xs) (<span class="org-haskell-constructor">Vector</span> ns) <span class="org-haskell-operator">=</span>
        <span class="org-haskell-keyword">let</span> n <span class="org-haskell-operator">=</span> head ns
        <span class="org-haskell-keyword">in</span> <span class="org-haskell-constructor">Vector</span> <span class="org-haskell-operator">$</span> map (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> x <span class="org-haskell-operator">**</span> n) xs

    logBase (<span class="org-haskell-constructor">Vector</span> xs) (<span class="org-haskell-constructor">Vector</span> ns) <span class="org-haskell-operator">=</span>
        <span class="org-haskell-keyword">let</span> n <span class="org-haskell-operator">=</span> head ns
        <span class="org-haskell-keyword">in</span> <span class="org-haskell-constructor">Vector</span> <span class="org-haskell-operator">$</span> map (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> logBase x n) xs

    sin (<span class="org-haskell-constructor">Vector</span> xs)       <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Vector</span> <span class="org-haskell-operator">$</span> map sin xs
    cos (<span class="org-haskell-constructor">Vector</span> xs)       <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Vector</span> <span class="org-haskell-operator">$</span> map cos xs
    tan (<span class="org-haskell-constructor">Vector</span> xs)       <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Vector</span> <span class="org-haskell-operator">$</span> map tan xs
    asin (<span class="org-haskell-constructor">Vector</span> xs)      <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Vector</span> <span class="org-haskell-operator">$</span> map asin xs
    acos (<span class="org-haskell-constructor">Vector</span> xs)      <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Vector</span> <span class="org-haskell-operator">$</span> map acos xs
    atan (<span class="org-haskell-constructor">Vector</span> xs)      <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Vector</span> <span class="org-haskell-operator">$</span> map atan xs
    sinh (<span class="org-haskell-constructor">Vector</span> xs)      <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Vector</span> <span class="org-haskell-operator">$</span> map sinh xs
    cosh (<span class="org-haskell-constructor">Vector</span> xs)      <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Vector</span> <span class="org-haskell-operator">$</span> map cosh xs
    tanh (<span class="org-haskell-constructor">Vector</span> xs)      <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Vector</span> <span class="org-haskell-operator">$</span> map tanh xs
    asinh (<span class="org-haskell-constructor">Vector</span> xs)     <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Vector</span> <span class="org-haskell-operator">$</span> map asinh xs
    acosh (<span class="org-haskell-constructor">Vector</span> xs)     <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Vector</span> <span class="org-haskell-operator">$</span> map acosh xs
    atanh (<span class="org-haskell-constructor">Vector</span> xs)     <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Vector</span> <span class="org-haskell-operator">$</span> map atanh xs
<span class="org-haskell-constructor">:</span>}




<span class="org-comment-delimiter">-- </span><span class="org-comment">------------------- Testing ------------------------ </span>



<span class="org-haskell-operator">&gt;</span> 10.0 <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Vector</span>
<span class="org-haskell-constructor">Vector</span> [10.0]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Vector</span>
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> xs <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Vector</span> [1.0, 2.0, 3.0, 4.0]
<span class="org-function-name">xs</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Vector</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> ys <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Vector</span> [10.0, 3.0, 5.0, 6.0] 
<span class="org-function-name">ys</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Vector</span>
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> ys <span class="org-haskell-definition">-</span> xs
<span class="org-haskell-constructor">Vector</span> [9.0,1.0,2.0,2.0]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Vector</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> xs <span class="org-haskell-definition">*</span> ys 
<span class="org-haskell-constructor">Vector</span> [10.0,6.0,15.0,24.0]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Vector</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">apply</span> sqrt xs
<span class="org-haskell-constructor">Vector</span> [1.0,1.4142135623730951,1.7320508075688772,2.0]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Vector</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">apply</span> sqrt ys
<span class="org-haskell-constructor">Vector</span> [3.1622776601683795,1.7320508075688772,2.23606797749979,2.449489742783178]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Vector</span>
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">scale</span> 4.0 ys <span class="org-haskell-operator">+</span> scale 3.0 xs
<span class="org-haskell-constructor">Vector</span> [43.0,18.0,29.0,36.0]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Vector</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">scale</span> 4.0 ys <span class="org-haskell-operator">/</span> scale 3.0 xs
<span class="org-haskell-constructor">Vector</span> [13.333333333333334,2.0,2.2222222222222223,2.0]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Vector</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> xs <span class="org-haskell-definition">+</span> repeatv 3.0 5 <span class="org-haskell-operator">+</span> ys
<span class="org-haskell-constructor">Vector</span> [14.0,8.0,11.0,13.0]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Vector</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">exp</span> xs
<span class="org-haskell-constructor">Vector</span> [2.718281828459045,7.38905609893065,20.085536923187668,54.598150033144236]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Vector</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> xs <span class="org-haskell-definition">+</span> sqrt ys
<span class="org-haskell-constructor">Vector</span> [4.16227766016838,3.732050807568877,5.23606797749979,6.449489742783178]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Vector</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> xs <span class="org-haskell-definition">**</span> 5.0 <span class="org-haskell-operator">-</span> scale 3.0 ys
<span class="org-haskell-constructor">Vector</span> [<span class="org-haskell-operator">-</span>29.0,23.0,228.0,1006.0]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Vector</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
