haskell/polymorphism_and_typeclasses.org
*** References 

See: 

  - *A Gentle Introduction to Haskell: Classes* Accessed at
    2017-3-0. Available at
    <https://www.haskell.org/tutorial/classes.html>

  - *Polymorphism - HaskellWiki* Accessed at 2017-3-5. Available at
    <https://wiki.haskell.org/Polymorphism>

  - *The Power of Polymorphism* Accessed at 2017-3-5. Available at
    <http://www2.sys-con.com/itsg/virtualcd/Java/archives/0508/barnabee/index.html>

  - *Lecture Notes, Type Classes in Haskell* Accessed at
    2017-3-0. Available at
    <https://john.cs.olemiss.edu/~hcc/csci450/14fall/notes/typeClasses.html>

  - *05-type-classes* Accessed at 2017-3-0. Available at
    <http://www.seas.upenn.edu/~cis194/spring13/lectures/05-type-classes.html>

  - *Chapter 6. Using Typeclasses* Accessed at 2017-3-0. Available at
    <http://book.realworldhaskell.org/read/using-typeclasses.html>
