haskell/polymorphism_and_typeclasses.html
<div id="outline-container-sec-1-3-4" class="outline-4">
<h4 id="sec-1-3-4"><span class="section-number-4">1.3.4</span> References</h4>
<div class="outline-text-4" id="text-1-3-4">
<p>
See: 
</p>

<ul class="org-ul">
<li><b>A Gentle Introduction to Haskell: Classes</b> Accessed at
2017-3-0. Available at
<a href="https://www.haskell.org/tutorial/classes.html">https://www.haskell.org/tutorial/classes.html</a>
</li>

<li><b>Polymorphism - HaskellWiki</b> Accessed at 2017-3-5. Available at
<a href="https://wiki.haskell.org/Polymorphism">https://wiki.haskell.org/Polymorphism</a>
</li>

<li><b>The Power of Polymorphism</b> Accessed at 2017-3-5. Available at
<a href="http://www2.sys-con.com/itsg/virtualcd/Java/archives/0508/barnabee/index.html">http://www2.sys-con.com/itsg/virtualcd/Java/archives/0508/barnabee/index.html</a>
</li>

<li><b>Lecture Notes, Type Classes in Haskell</b> Accessed at
2017-3-0. Available at
<a href="https://john.cs.olemiss.edu/~hcc/csci450/14fall/notes/typeClasses.html">https://john.cs.olemiss.edu/~hcc/csci450/14fall/notes/typeClasses.html</a>
</li>

<li><b>05-type-classes</b> Accessed at 2017-3-0. Available at
<a href="http://www.seas.upenn.edu/~cis194/spring13/lectures/05-type-classes.html">http://www.seas.upenn.edu/~cis194/spring13/lectures/05-type-classes.html</a>
</li>

<li><b>Chapter 6. Using Typeclasses</b> Accessed at 2017-3-0. Available at
<a href="http://book.realworldhaskell.org/read/using-typeclasses.html">http://book.realworldhaskell.org/read/using-typeclasses.html</a>
</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: nobody</p>
<p class="date">Created: 2018-05-07 Mon 11:30</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
